# Encoding categorical data:

# Ordinal encoding

**What is Ordinal Encoding?**

Imagine you're helping a friend sort their movie collection. Three categories are available to you : "terrible," "okay," and "awesome." Each category is given a number by ordinal encoding, such as "terrible" = 1, "okay" = 2, and "awesome" = 3. In this manner "awesome" movies come after "okay" ones so the computer can comprehend. One way to transform categorical data into numerical data is to use ordinal encoding. 'Red, Green and Blue ' are examples of categories or groups that are represented by categorical data. Each category in ordinal encoding is given an integer, such as 1 for "Red," 2 for "Green," and 3 for "Blue." The important thing to remember is that these categories have a purposeful hierarchy. Here are some key terms to remember:

Category: A group of similar things, like the movie ratings in our example.

Ordinal Data: Data that has a natural order like movie ratings shirt sizes (small, medium, large), or video game difficulty levels (easy, normal, hard).
Encoding: Converting data into a format a computer can understand.

- Ordinal encoding use on ordinal categorical data 
  - EXP : University,College,School.
- Ml algorithm expect numbers so we transform categorical to numerical to perform.
- Given orders its your responsiblity coz this function don't know about the rank.
  
----------

**Label encoding**

- It use when the target values is categorical
  - EXP : Yes , NO = 1 , 0.

## Import Libraries:

In [1]:
import pandas as pd

## Load Dataset:

In [2]:
df=pd.read_csv('../Data/Salary_Data.csv')
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

--------

1. Age columns is numeric. 
2. Gender column is categorical but its nominal so here we use (One hot encoding).
3. Education level is categorical + Ordinal here we use (Ordinal encoding).
4. Job title is categorical.
5. Years of experience is numeric.
6. Salary the target column is numeric if there is categorical column so we can use (Label encoding).

-------

In [3]:
df=df.iloc[:,2]

In [4]:
df=pd.DataFrame(df)
df

        Education Level
0            Bachelor's
1              Master's
2                   PhD
3            Bachelor's
4              Master's
...                 ...
6699                PhD
6700        High School
6701  Bachelor's Degree
6702    Master's Degree
6703        High School

[6704 rows x 1 columns]

In [5]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 1 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Education Level  6701 non-null   object
dtypes: object(1)
memory usage: 52.5+ KB

          Education Level
count                6701
unique                  7
top     Bachelor's Degree
freq                 2267

In [6]:
df.dropna(inplace=True)

In [7]:
df.isnull().sum()

Education Level    0
dtype: int64

In [8]:
df = df.replace({'Bachelor\'s': 'Bachelor\'s Degree','Master\'s': 'Master\'s Degree', 'phD': 'PhD'})

**Ordinal Encoding**

In [9]:
from sklearn.model_selection import train_test_split

X_train,X_test,y_train,y_test=train_test_split(df,df,test_size=0.2,random_state=2)

In [10]:
X_train,X_test

(        Education Level
 1632                PhD
 4181  Bachelor's Degree
 3708  Bachelor's Degree
 5365  Bachelor's Degree
 219   Bachelor's Degree
 ...                 ...
 6446        High School
 3609    Master's Degree
 5707    Master's Degree
 6640                PhD
 2578    Master's Degree

 [5360 rows x 1 columns],
         Education Level
 813   Bachelor's Degree
 1542    Master's Degree
 1855  Bachelor's Degree
 1211                PhD
 6155  Bachelor's Degree
 ...                 ...
 6016  Bachelor's Degree
 3854    Master's Degree
 6608  Bachelor's Degree
 464   Bachelor's Degree
 5885    Master's Degree

 [1341 rows x 1 columns])

In [11]:
X_train.value_counts()

Education Level
Bachelor's Degree    2423
Master's Degree      1477
PhD                  1097
High School           363
Name: count, dtype: int64

In [12]:
from sklearn.preprocessing import OrdinalEncoder

oe=OrdinalEncoder(categories =[["High School",'Bachelor\'s Degree',"Master\'s Degree",'PhD']])

oe.fit(X_train)

X_train_oe=oe.transform(X_train)
X_test_oe=oe.transform(X_test)

In [13]:
oe.categories_

[array(['High School', "Bachelor's Degree", "Master's Degree", 'PhD'],
       dtype=object)]

Rank =[0:High school , 1:Bachelor's degree , 2:Master's degree , 3:PhD]

In [14]:
X_train

        Education Level
1632                PhD
4181  Bachelor's Degree
3708  Bachelor's Degree
5365  Bachelor's Degree
219   Bachelor's Degree
...                 ...
6446        High School
3609    Master's Degree
5707    Master's Degree
6640                PhD
2578    Master's Degree

[5360 rows x 1 columns]

In [15]:
X_train_oe

array([[3.],
       [1.],
       [1.],
       ...,
       [2.],
       [3.],
       [2.]])

In [16]:
X_test

        Education Level
813   Bachelor's Degree
1542    Master's Degree
1855  Bachelor's Degree
1211                PhD
6155  Bachelor's Degree
...                 ...
6016  Bachelor's Degree
3854    Master's Degree
6608  Bachelor's Degree
464   Bachelor's Degree
5885    Master's Degree

[1341 rows x 1 columns]

In [17]:
X_test_oe

array([[1.],
       [2.],
       [1.],
       ...,
       [1.],
       [1.],
       [2.]])

**ALL SET**